print("---------------------------------------------")
while True:
    try:
        a = int(input("Введите сторону a: "))
        b = int(input("Введите сторону b: "))
        c = int(input("Введите сторону c: "))
        
        if a <= 0 or b <= 0 or c <= 0:
            print("Ошибка: Стороны треугольника должны быть больше нуля. Попробуйте снова.\n")
            continue
            
        if not (a + b > c and a + c > b and b + c > a):
            print("Ошибка: Треугольник с такими сторонами не существует. Попробуйте снова.\n")
            continue
            
        break
        
    except ValueError:
        print("Ошибка: Нужно вводить только целые числа! Попробуйте снова.\n")


if a == b == c:
    answer = "равносторонний"
elif a == b or b == c or c == a:
    answer = "равнобедренный"
else:
    answer = "расзносторонний"

print(f"Ваш треугольник {answer}")
print("---------------------------------------------")
